Revit 2026 API

# EffectInstance Methods

---

The EffectInstance type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValid | Tests whether the effect instance is valid for rendering. |
|  | MatchesFormat | Tests whether the effect instance is appropriate for the given vertex format. |
|  | SetAmbientColor | Sets the ambient color parameter of the effect instance. |
|  | SetColor | Sets the color parameter of the effect instance. |
|  | SetDiffuseColor | Sets the diffuse color parameter of the effect instance. |
|  | SetEmissiveColor | Sets the emissive color parameter of the effect instance. |
|  | SetGlossiness | Sets the glossiness parameter of the effect instance. |
|  | SetSpecularColor | Sets the specular color parameter of the effect instance. |
|  | SetTransparency | Sets the transparency parameter of the effect instance. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

EffectInstance Class

Autodesk.Revit.DB.DirectContext3D Namespace